---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.Contains(System.String)
source: html/c68e9029-e9a2-5d72-6ec6-26c8783d3bad.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Contains Method

Tests for the existence of a category with that name within the map.

## Syntax (C#)
```csharp
public virtual bool Contains(
	string key
)
```

## Parameters
- **key** (`System.String`) - The category name to be searched for.

## Returns
The Contains method returns True if the name is within the map, otherwise False.